var ara = '{ ' +
        ' "movies": [ {"name":"الشبح","hint":"احمد عز"},\n\
                         {"name":"القرموطى","hint":"احمد ادم"} ,\n\
                         {"name":"الحاسهالسبعه","hint":"احمد مكى"} ,\n\
                         {"name":"اللمبى","hint":"محمد سعد"} ,\n\
                         {"name":"الفمبروك","hint":"احمد حلمى"} ,\n\
                         {"name":"السفاح","hint":"هانى سلامه"} ,\n\
                         {"name":"الفرح","hint":"خالد الصاوى ابو شيماء اتهور"} ,\n\
                         {"name":"بدلفاقد","hint":"احمد عز"} ,\n\
                         {"name":"ظرفطارق","hint":"احمد حلمى"},\n\
                         {"name":"الكيف","hint":"محمود عبد العزيز"}],' +
        ' "sports":   [ {"name":"الاهلى","hint":"افضل نادى فى مصر"},\n\
                         {"name":"تشلسى","hint":"افضل نادى فى انجلترا"},\n\
                         {"name":"الزمالك","hint":"اسوء نادى فى مصر"},\n\
                         {"name":"دورتموند","hint":"افضل نادى فى المانيا"},\n\
                         {"name":"بارس","hint":"افصل نادى فى فرنسا"},\n\
                         {"name":"الاتحاد","hint":"افضل نادى فى اسكندريه"},\n\
                         {"name":"بنها","hint":"افضل نادى فى بنها"},\n\
                         {"name":"المصرى","hint":"افضل نادى فى بورسعيد"},\n\
                         {"name":"برشلونه","hint":"افضل نادى فى اسبانيا"},\n\
                         {"name":"روما","hint":"افضل نادى فى ايطاليا"}],' +
        ' "arts":   [ {"name":"مومنعادل","hint":"احسن ممثل فى اى تى اى"},\n\
                         {"name":"عادلامام","hint":"احسن ممثل فى مصر"},\n\
                         {"name":"مومنوعادل","hint":"اخنق اتنين فى التراك بتعنا"},\n\
                         {"name":"احمدعلى","hint":"اكتر واحد هلاس فى التراك"},\n\
                         {"name":"مومن","hint":"احسن واحد بيلعب فيفا"},\n\
                         {"name":"محمدمصطفى","hint":"الزقزوق"},\n\
                         {"name":"عبدالرحمن","hint":"الصعيدى بتاع التراك"},\n\
                         {"name":"مسعود","hint":"الاسمعلاوى"},\n\
                         {"name":"مورجانفرىمان","hint":"احسن ممثل فى هوليود"},\n\
                         {"name":"شاروخان","hint":"احسن ممثل فى بوليود"}]\n\
             }';


function readjsonarabic(category) 
{
    var obj = JSON.parse(ara);
    var s = Math.floor((Math.random() * 10 ));

    switch (category)
	{
        case '1':
            return obj.movies[s];
            break;
        case '2':
            return obj.sports[s];
            break;
        case '3':
            return obj.arts[s];
            break;
    }
}